[
  {
    "title": "EXPLORING POWER DISTRIBUTION NETWORKS",
    "tags": ["electronics"],
    "url": "https://jmw.name/projects/exploring-pdns/",
    "cache": "dd522a3773ee64dad379146ce58db7d4.html",
    "comment": "",
    "hint": "Anyone who has done electronics design knows the importance of bypass or decoupling capacitors, but mostly through received wisdom such as: “each IC should have a .1 µF capacitor,” “add one 1 µF for every eight ICs,” place decoupling capacitors “as close as possible,” and so on [1][2]. There’s very little in popular sources about experimentally measuring and verifying the effect of capacitor networks.  A circuit board typically receives power from a source off-board and then passes it through a voltage regulation module to provide a steady voltage to the rest of the board. A circuit board’s power distribution network (PDN) consists of everything between the voltage regulator and the power-consuming devices on the board, including bulk and decoupling capacitors, traces, and power planes and interconnecting vias. The purpose of the PDN is to deliver clean, low-noise voltage to the rest of the circuit board. Voltage noise on the PDN is the result of transient currents passing through the impedance of the PDN, and the goal in PDN design is to provide an acceptably low impedance from DC to the highest frequency of interest for the circuit.  The standard for measuring PDN impedance is a vector network analyzer (VNA) in a two-port shunt-thru connection [3]. VNAs are very expensive and most are designed for applications in radio and microwave communications rather than general impedance analysis (frequency ranges going up into the tens of gigahertz, but bottoming out at hundreds of kilohertz or the low single-digit megahertz range). I’ve been exploring using a more humble setup of a spectrum analyzer and tracking generator to get good results, as long as some reasonable assumptions hold."
  },
  {
    "title": "The basics of decoupling capacitors",
    "tags": ["electronics"],
    "url": "https://lcamtuf.substack.com/p/the-basics-of-decoupling-capacitors",
    "cache": "ad972c9616890a3869214189729da5d7.html",
    "comment": "Some contents may be not accurate. See HN News post for this article.",
    "hint": "Two decades ago, to build a portable music player, you had to clobber together several hundred electronic components. Today, you can accomplish the same with a single chip and a dozen passives. Heck, you might even get Wi-Fi and Bluetooth for free.  One of the few discrete components that survive and thrive in the face of growing integration is the humble decoupling capacitor. It’s not just that the device is hard to manufacture on the die of an integrated circuit; in the world high data speeds and low supply voltages, it has an increasingly important role to play in keeping the circuits humming along."
  },
  {
    "title": "The basics of decoupling capacitors | Hacker News",
    "tags": ["Hacker News", "electronics"],
    "url": "https://lcamtuf.substack.com/p/the-basics-of-decoupling-capacitors",
    "cache": "9bc20637af34a301a82f898ea0c14586.html",
    "comment": "",
    "hint": ""
  }
]